<template>
    <div class="protocol">
        <div>
            <p class='header'>前言</p>
            <p>协议是由用户（以下“您”）与药材买卖网就我们所提供的产品和服务（包括我们的网站以及我们现在正在提供和将来可能向您提供的网络服务，以下统称为“产品和服务”）所订立的协议。</p>
            <p>如果您获得并使用我们所提供的产品和服务，则应视为您已经详细阅读了本协议的内容，同意本协议的内容，并同意遵守本协议的规定。为保障您的权益，请于注册使用本公司所提供的各种服务之前，仔细阅读以下规定。一旦您注册成为药材买卖网会员，即表示您同意并愿意遵守以下所有规定；另外提醒您，此处之规定随时可能会进行适当的变更，请定期查询。</p>
            <p class='title'>一、关于服务内容</p>
            <p>（1）药材买卖网络服务的具体内容由我们根据实际情况提供并保留随时变更、中断或终止部分或全部网络服务的权利。</p>
            <p>（2）药材买卖网在提供网络服务时，可能会对部分网络服务用户收取一定的费用。在此情况下，会在相关页面上做明确的提示。如用户不同意支付该等费用，则可不接受相关的网络服务。</p>
            <p>（3）用户理解：仅提供相关的网络服务，除此之外与相关网络服务有关的设备(如电脑、调制解调器及其他与接入互联网有关的装置)及所需的费用(如为接入互联网而支付的电话费及上网费)均应由用户自行负担。</p>
            <p>（4）用户应使用正版软件接受网络服务。</p>
            <p class='title'>二、有关注册资料</p>
            <p>1.提供个人注册资料</p>
            <p>（1）在申请药材买卖网通行证会员账号时，您向我们提供的是及时、详细及准确的个人资料；</p>
            <p>（2）所有由您提供的个人资料将被我们用来作为识别您和其他用户的依据；</p>
            <p>（3）如果您所提供的个人注册资料与事实不符，或已变更而未及时更新，或有任何误导之嫌，导致我们无法为您提供或进一步提供产品和服务，我们将不承担任何责任。</p>
            <p>2.修改注册资料</p>
            <p>您可以在任何时候，通过我们官方网站提供的会员服务或我们公布的其他途径，更新或修改您申请注册时所提供的资料。</p>
            <p>3.个人资料的披露</p>
            <p>为了向您提供产品和服务，您同意授权我们以我们认为适当的方式向第三方透露您的注册资料。但是，我们不会公开您的姓名、住址、通讯地址、电子邮箱、账号、密码等个人资料。除非：</p>
            <p>（1）您允许我们披露这些个人资料；</p>
            <p>（2）有关法律法规或行政规章要求我们披露您的个人资料；</p>
            <p>（3）司法机关或行政机关基于法定程序要求我们披露您的个人资料；</p>
            <p>（4）为保护我们的知识产权和其他财产权益，需要披露您的个人资料；</p>
            <p>（5）在紧急情况下为保护其他用户和社会大众的人身安全，需要披露您的个人资料。</p>
            <p>我们将采取商业上合理的方式以保护您的个人资料的安全。我们将使用通常可以获得的安全技术和程序来保护您的个人资料不被未经授权的访问、使用或泄漏。对于非因我们的疏忽而造成您账号的丢失或您个人资料的泄密，我们不承担任何责任。</p>
            <p class='title'>三、关于账号和密码</p>
            <p>此处指的是您注册成功的账号及密码。请了解账号在注册之后不可变更，而密码可以通过我们提供的服务进行修改。您对于您的账号及密码的保管以及使用该账号和密码所进行的一切行动负有完全的责任。请不要将账号、密码转让或出借给他人使用。因为您的保管疏忽或其他任何个人行为导致您的账号或密码遭他人非法使用及因此所衍生的任何后果，我们不承担任何责任。</p>
            <p class='title'>四、您的权利</p>
            <p>1.您可以根据本协议以及我们不时更新和公布的其他规则使用我们提供的产品和服务。</p>
            <p>2.您有权在使用我们提供的产品和服务期间监督我们及我们的工作人员是否按照我们所公布的标准向您提供产品和服务，也可以随时向我们提出与我们的产品和服务有关的意见和建议。</p>
            <p>3.如果您不同意本协议条款，或对我们后来更新的条款有异议，或对我们所提供的产品和服务不满意，您可以选择停止使用我们的产品和服务。如果您选择停止使用我们的产品和服务，则我们即不再对您承担任何义务和责任。</p>
            <p class='title'>五、您的义务</p>
            <p>1.您同意按照我们不时发布、变更和修改的本协议条款及其他规则接受并使用我们的产品和服务，您不得通过不正当的手段或其他不公平的手段使用我们的产品和服务或参与我们活动。</p>
            <p>2.您不得干扰我们正常地提供产品和服务，包括但不限于：</p>
            <p>（1）攻击、侵入我们的网站服务器或使网站服务器过载；</p>
            <p>（2）破解、修改我们提供的客户端程序；</p>
            <p>（3）攻击、侵入我们的游戏服务器或游戏服务器端程序或使游戏服务器过载；</p>
            <p>（4）制作、使用、发布、传播任何形式的妨碍游戏公平性的辅助工具或程序（外挂）；</p>
            <p>（5）利用程序的漏洞和错误（Bug）破坏游戏的正常进行或传播该漏洞或错误（Bug）；</p>
            <p>（6）不合理地干扰或阻碍他人使用我们所提供的产品和服务。</p>
            <p>3.您必须保管好自己的账号和密码，由于您的原因导致账号和密码泄密而造成的后果均将由您自行承担。</p>
            <p>4.您仅能以一个单独的个人的身份使用我们所提供的产品和服务，您不能利用我们所提供的产品和服务从事商业目的的活动，也不能利用我们的产品和服务进行销售或其他商业目的的活动。</p>
            <p>5.您需对自己账号中的所有活动和事件负责。您须遵守有关互联网信息发布的有关法律、法规及通常适用的互联网一般道德和礼仪的规范，您将自行承担您所发布的信息内容的责任。特别的，您不得发布下列内容：</p>
            <p>（1）反对宪法所确定的基本原则的；</p>
            <p>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
            <p>（3）损害国家荣誉和利益的；</p>
            <p>（4）煽动民族仇恨、民族歧视，破坏民族团结的；</p>
            <p>（5）破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
            <p>（6）散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
            <p>（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
            <p>（8）侮辱或者诽谤他人，侵害他人合法权益的；</p>
            <p>（9）含有法律、行政法规禁止的其他内容的。</p>
            <p>（10）侵犯任何第三者的知识产权，版权或公众/私人权利的。</p>
            <p>（11）违反人文道德、风俗习惯的。</p>
            <p>6.您的账号以及与我们产品相关的论坛昵称不得包含本协议五条第5款所禁止发布的内容。</p>
            <p class='title'>六、隐私保护</p>
            <p>1.保护用户（特别是未成年人）的隐私是的一项基本政策，因此，若父母（监护人）希望未成年人（尤其是十岁以下子女）得以使用本服务，必须以父母（监护人）名义申请注册，在接受本服务时，应以法定监护人身份加以判断本服务是否符合于未成年人。 我们保证不对外公开或向第三方 （5.2所列情况除外）提供用户注册资料及用户在使用网络服务时存储在的非公开内容，但下列情况除外：</p>
            <p>(1)事先获得用户的明确授权；</p>
            <p>(2)根据有关的法律法规要求；</p>
            <p>(3)按照相关政府主管部门的要求；</p>
            <p>(4)为维护社会公众的利益；</p>
            <p>(5)为维护的合法权益。</p>
            <p>2.我们可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与同等的保护用户隐私的责任，则可将用户的注册资料等提供给该第三方。</p>
            <p>3.在不透露单个用户隐私资料的前提下，有权对整个用户数据库进行技术分析并对已进行分析、整理后的用户数据库进行商业上的利用。 尽管对用户的隐私权保护做了极大的努力，但是仍然不能保证现有的安全技术措施使用户的技术信息等不受任何形式的损失。</p>
            <p class='title'>七、免责声明</p>
            <p>1.药材买卖网通行证所有者不保证以下事宜：</p>
            <p>(1) 本服务将符合您的要求</p>
            <p>(2) 本服务将不受干扰、及时提供、安全可靠或不会出错。</p>
            <p>2.用户明确同意其使用网络服务所存在的风险将完全由其自己承担；因其使用网络服务而产生的一切后果也由其自己承担，对用户不承担任何责任。</p>
            <p class='title'>八、服务变更、中断或终止</p>
            <p>1.如因系统维护或升级的需要而需暂停网络服务，将尽可能事先进行通告。</p>
            <p>2.如发生下列任何一种情形，有权随时中断或终止向用户提供本协议项下的网络服务而无需通知用户：</p>
            <p>(a) 用户提供的个人资料不真实；</p>
            <p>(b) 用户违反本协议中规定的使用规则。</p>
            <p>3.除前款所述情形外，同时保留在不事先通知用户的情况下随时中断或终止部分或全部网络服务的权利，对于所有服务的中断或终止而造成的任何损失，无需对用户或任何第三方承担任何责任。</p>
            <p class='title'>九、服务中断、停止和变更的说明</p>
            <p>发生下列情形之一时，我们有权中断、停止或变更我们提供的服务，对于因此而产生的困扰、不便或损失，我们不承担任何责任：</p>
            <p>1.定期检查或施工，软硬件更新等，即暂停服务，我们将尽快完成维修、维护工作。</p>
            <p>2.服务器遭到任何形式的破坏，无法正常运作。</p>
            <p>3.网络线路或其它导致玩家通过Internet连接至我们服务器的动作发生滞碍等情形。</p>
            <p>4.自然灾害等不可抗力的因素。</p>
            <p>5.在紧急情况之下为维护国家安全或其它会员及第三者人身安全时。</p>
            <p>6.发生突发性软硬件设备与电子通信设备故障时。</p>
            <p class='title'>十、资费政策</p>
            <p>我们将有权决定我们所提供的产品和服务的资费标准和收费方式，我们可能会就不同的产品和服务制定不同的资费标准和收费方式，也可能按照我们所提供的产品和服务的不同阶段确定不同的资费标准和收费方式。另外，我们也可能不时地修改我们的资费政策。我们会将有关产品和服务的收费信息以及与该产品和服务有关的资费标准、收费方式、购买方式或其他有关资费政策的信息放置在该产品和服务相关网页的显著位置。</p>
            <p>对于我们的收费产品和服务，您应该按照我们确定的资费政策购买我们的产品和服务。如果您未按我们确定的资费政策购买我们的产品和服务，我们可以立即停止向您提供该产品和服务。</p>
            <p class='title'>十一、有限保证及责任限制</p>
            <p>对于我们的产品和服务，我们仅作下述有限保证，该有限保证取代任何文档、包装、或其他资料中的任何其他明示或默示的保证（如果有）。</p>
            <p>我们仅以“现有状况且包含所有错误”的形式提供相关的产品、软件或程序及任何支持服务，并仅保证：</p>
            <p>（1）我们所提供的产品和服务能基本符合我们正式公布的要求；</p>
            <p>（2）我们所提供的相关产品和服务基本与我们正式公布的服务承诺相符；</p>
            <p>（3）我们仅在商业上允许的合理范围内尽力解决我们在提供产品和服务过程中所遇到的任何问题。</p>
            <p>在适用法律允许的最大范围内，我们明确表示不提供任何其他类型的保证，不论是明示的或默示的，包括但不限于适销性、适用性、可靠性、准确性、完整性、无病毒以及无错误的任何默示保证和责任。</p>
            <p>另外，在适用法律允许的最大范围内，我们并不担保我们所提供的产品和服务一定能满足您的要求，也不担保提供的产品和服务不会被中断，并且对产品和服务的及时性，安全性，出错发生以及信息是否能准确、及时、顺利地传送均不作任何担保。</p>
            <p>在适用法律允许的最大范围内，我们不就因您使用我们的产品和服务引起的，或在任何方面与我们的产品和服务有关的任何意外的、非直接的、特殊的、或间接的损害或请求（包括但不限于因人身伤害、因隐私泄漏、因未能履行包括诚信或合理谨慎在内的任何责任、因过失和因任何其他金钱上的损失或其他损失而造成的损害赔偿）承担任何责任。</p>
            <p class='title'>十二、风险承担</p>
            <p>您同意使用我们提供的服务是出于您的个人意愿，并愿自负任何风险，包括但不限于您因执行我们所提供的服务程序而导致您或您所使用的计算机系统受到损害或发生任何资料的流失等。</p>
            <p>注意：个人操作导致出错的任何结果，由个人自行负责，官方不给予任何形式的赔偿！</p>
            <p class='title'>十三、损害赔偿</p>
            <p>您若违反本协议或相关法令，导致我们的母公司、子公司、附属公司、关系企业、受雇人、代理人及其他一切相关履行辅助人员因此受到损害或支出一切衍生费用（包括但不限于支付上述人士须就您的违反行为所进行的一切辩护或索偿诉讼及相关和解之法律费用），您应负担损害赔偿及费用承担责任。</p>
            <p class='title'>十四、公司拥有终止权</p>
            <p>您应确实遵守本协议及有关法律命令的规定。我们对于您是否违反本协议拥有最终决定权。若我们认定您违反本协议或任何法令，我们有权在无需向您进行事先通知的情况之下，立即暂停及终止或删除您账号与您账号中的所有相关资料、档案及任何记录，以及取消、停止、限制您的会员资格。如有系统故障、Bug、程序出错等等问题，我们有权把您的资料还原到一定日期，以维护平台权益。您不得因此要求补偿或赔偿。</p>
            <p>为了向您提供产品和服务，我们可能会需要定期或不定期地对有关的网站服务器或我们所提供的产品和服务的相关官方网站进行维护，该维护可能造成服务的中断，并且该中断可能没有事先的通知，对于由此引起的中断我们不承担任何责任。</p>
            <p>您已经了解并同意对于因我们、我们的合作方或电信网络系统软硬件设备的故障、失灵或人为操作的疏失而全部或部分中断、暂时无法使用、迟延并造成我们提供产品和服务的停止或中断的，我们不承担任何责任；对于因他人侵入我们的网络或游戏系统，篡改、删改或伪造、变造网站和游戏资料或数据而造成我们的产品和服务的停止或中断，我们也不承担任何责任。</p>
            <p class='title'>十五、至第三方站点的链接</p>
            <p>您可能在使用我们的产品和服务过程中链接到第三方的站点。第三方的站点不由我们控制，并且我们也不对任何第三方站点的内容、第三方站点包含的任何链接、或第三方站点的任何更改或更新负责。我们仅为了提供便利的目的而向您提供这些到第三方站点的链接，我们所提供的这些链接并不意味着我们认可该第三方站点。您需要检查并遵守该第三方站点的相关规定。</p>
            <p class='title'>十六、与法律的冲突</p>
            <p>本协议的解释、效力及适用以中华人民共和国法律为依据。如果本协议的任何内容与法律相抵触，应以法律规定为准。</p>
            <p class='title'>十七、个别条款的效力</p>
            <p>本协议所定的任何条款的一部或全部无效者，不影响其它条款的效力。</p>
            <p class='title'>十八、修改和解释权</p>
            <p>基于对我们本身、用户及市场状况不断变化的考虑，我们保留随时修改、新增、删除本协议条款的权利，修改、新增、删除本协议条款时，我们将于官方网站首页公告修改、新增、删除的事实，而不另行对您进行个别通知。若您不同意我们所修改、新增、删除的内容，可停止使用我们所提供的服务。若您继续使用我们的服务，则视同您同意并接受本协议条款修改、新增、删除后之一切内容，且不得因此而要求任何补偿或赔偿。</p>
            <p>我们保留对本协议条款、产品和服务以及我们所提供的产品和服务的相关官方网站的最终解释权。</p>
        </div>
    </div>
</template>
<script>
import common from '../common/common.js'
import myHeader from '../components/tools/myHeader'
export default {
    data() {
            return {
                wrapperHeight: '',
                show: true,
                my_header: {
                    name: '',
                }
            }
        },
        components: {
            myHeader
        },
        methods: {

        },
        created() {
            let from = this.$route.params.from;
            if (from == 'ios') {
                this.show = false;
            }
        },
        mounted() {
            // this.wrapperHeight = document.documentElement.clientHeight - this.$refs.wrapper.getBoundingClientRect().top ;
        }
}
</script>
<style scoped>
.protocol {}

.protocol .bg_white {
    background-color: #fff;
}

.protocol p {
    text-indent: 32px;
    text-align: left;
    margin: 10px;
    font-size: 16px;
    white-space: normal;
}

.protocol .header {
    font-weight: 600;
    text-indent: 0px;
}

.protocol .title {
    text-indent: 28px;
    font-weight: 600;
}
</style>
